Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Who's Mr. President.tmx
Source language: id
Languages: en

source: BISA MENYANGKAL KARENA
en: deny him since

source: MEMANGGILMU
en: here

source: SENDIRI UNTUK
en: for a little

source: Tamat
en: It’s all

source: PRIBADINYA?
en: benefit?

source: AKU RASA
en: maybe

source: INI TENTANG SI KEV-
en: it’s about kev...

source: KEREN!
en: cool!

source: LAIN…
en: this side of him...

source: 16 TAHUN, KELAS 11.
en: 16, an eleventh-grader.

source: RESIKO YANG AKAN
en: to minimize the risk

source: AKU MENUGASKAN
en: I ordered

source: SIAPA YANG PEDULI
en: who the hell cares

source: KEESOKAN HARINYA.
en: The next day.

source: MEMANG BEGITU
en: like that

source: M-MAKSUD BAPAK
en: Wh-what do you mean by

source: KALAU
en: If something

source: HUBUNGANKU DENGAN
en: Our relationship

source: KAK LEO, KETUA
en: Leo,

source: AKU TIDAK MENDENGAR JAWABANMU.
en: just answer me.

source: DENGAR GOSIPNYA
en: she had an argument

source: ...Bisa ikut kami sebentar?
en: can you come with us?

source: RASANYA TIDAK
en: There’s no such

source: BERKAT BANTUAN
en: from a very helpful

source: KETUA?
en: to you, Leo?

source: AH BENAR, SAYA
en: Oh, right, I haven’t

source: SITUASI SEDANG
en: everything was

source: JAUH LEBIH
en: for you

source: TAPI KAKAK HARUS BERJANJI TIDAK AKAN BERBOHONG LAGI!
en: but you have to promise that you’ll never lie to me again!

source: kakak kaget
en: why are you

source: HAL YANG TIDAK
en: bad

source: MASALAH KALAU WAKATOS
en: if she’s close

source: DITAMBAH LAGI, KAMU KETUA OSIS!
en: you’re the osis’s president!

source: IYA,
en: Yeah...

source: SEKITAR"…
en: OSIS?”

source: RUANGAN APA INI??
en: Where are we?!

source: SAYA BERUSAHA UNTUK TIDAK
en: so I tried to

source: …HEI, SEPERTI
en: So,

source: itu informasi yang
en: an important piece

source: E-EHH!??
en: seriously?!

source: KALIAN SALAH PAHAM!!
en: it’s just a misunderstanding!

source: SEBAIKNYA KAU
en: I think it’d better

source: OSIS SMA KITA,
en: vice president of OSIS.

source: LEO PUNYA
en: his ritual

source: TUGAS INI.
en: get working.

source: KALAU CUMA
en: If you’re here

source: JUGA?
en: for a bit?

source: TUJUANKU UNTUK MENCARI
en: about myself and my investigation

source: Taman menara jam,
en: Clock Tower,

source: WAKIL KETUA OSIS.
en: the vice president.

source: BAGIKU ITU
en: For me,

source: KE INTINYA!!
en: already!

source: SETENGAH-SETENGAH.
en: half-heartedly.

source: 'KAN KUBILANG JUGA
en: this is

source: DAN SAYA KAGET, 'NAK CHIARA TETAP BERSEDIA MENJADI WAKIL KETUA OSIS.
en: to my pleasant surprise, chiara is still willing to serve as vice president, which is great news.

source: YANG MUDAH UNTUK
en: this isn’t

source: SAJA MENGAWASI
en: is to monitor

source: MENDAPAT KABAR,
en: heard about it,

source: ERLANGGA TERLIBAT
en: Erlangga was

source: SAYA BERHARAP KAMU
en: I’m hoping that

source: JAM ISTIRAHAT KEDUA.
en: second break

source: ...INI BISA DIBILANG RAHASIA UMUM YANG KONTROVERSIAL UNTUK DIBICARAKAN,
en: this is a touchy subject to bring up, but many people are aware of it.

source: LAIN.
en: some info.

source: APA YANG TADI MAU
en: you’ve got some new

source: MAU MENDENGAR
en: to hear

source: LALU SEKARANG APA YANG HARUS SAYA LAKUKAN?
en: what should I do now?

source: MENYENDIRI, YA?
en: very quiet today...

source: INGIN KAMU
en: just want you

source: ATAS INSTRUKSI KETUA
en: Leo himself has asked his sister

source: Menyedihkan!
en: how pathetic!

source: TIAP KALI KAMU
en: every word that

source: MENGHUBUNGIKU
en: me

source: SENDIRIAN AJA
en: Are you on your

source: TAPI
en: But,

source: KARENA INI
en: It’s important

source: KAK!
en: Ezra.

source: TAPI…
en: but...

source: TAHU ALASAN KENAPA
en: know why

source: DULU BAPAK
en: You said

source: SERING MENGAMBIL
en: your feelings have clouded

source: …GAWAT.
en: ...Crap.

source: DULUAN…
en: me...

source: TAPI KENAPA KAKAK TIDAK MELAKUKANNYA!??
en: ...but why didn’t you say anything?

source: ANGGOTA
en: of

source: SAJA SUDAH
en: that’s really

source: KARAKTER ASLI
en: weren’t acting,

source: DIA BISA TAHU
en: he know

source: SEMUANYA KE
en: everything

source: Tampilan Perdana Hedwig
en: Hedwig’s first appearance

source: TADI, SAYA TIDAK BISA
en: stay

source: KITA KATAKAN HANYA
en: or say to her,

source: AKHIRNYA KAMU MEMBERITAHU SAMU YANG TERJADI PADANYA?
en: ...because he insisted on it?

source: INI WAKATOS
en: been

source: Kami tidak bisa pilih-pilih pekerjaan karena tuntutan hidup…
en: we can’t be picky about work since we also have needs.

source: DENGAR KABAR
en: about this

source: …Perhatian?
en: attention?

source: IYA, AKU JANJI.
en: okay, I promise.

source: BELUM AKU KETAHUI
en: missing

source: KALAU KAU NAKSIR
en: on the

source: …Aku ini kalau sedang berada di situasi tertentu, sering mengatakan hal yang berlawanan dengan apa yang sebenarnya aku pikirkan.
en: when I’m in certain situations, I say things I don’t mean...

source: PERKATAAN ANAK
en: His statements

source: FU FU
en: he he

source: ORGANISASI YANG
en: an organization

source: KENAPA AKU TIDAK MERASA SEPENUHNYA SENANG?
en: ...why am I feeling a bit unhappy?

source: GENIT, TAPI ITU TIDAK
en: a ladies’ man, but

source: RUPANYA.
en: see...

source: MAKA DARI ITU,
en: that’s why...

source: DENGAN ARDHAN,
en: Ardhan,

source: ADA APA?
en: happened?

source: MUNGKIN,
en: possible...

source: KETUA MELANGGAR ATURAN
en: that you violated the rules

source: LANGSUNG BICARA
en: and just get to point

source: mustahil.
en: kind of a stretch.

source: Apakah itu memang trait dari keluarga Sanjaya?
en: is it a trait inherited from that family?

source: bukan murid
en: not regular

source: EPISODE BERIKUTNYA!
en: for the next episode!

source: BERDASARKAN
en: From what

source: MEMINTA TOLONG PADA
en: who had asked

source: CHIARA DENGAN
en: between chiara and

source: ITU ABSEN LATIHAN,
en: doesn’t like to skip practice.

source: KAK LEO?
en: Leo?

source: ...A-AKU
en: I-I was worried...

source: SEPERTINYA SEJAK
en: I think

source: BURUK,
en: anything,

source: KENYATAANNYA
en: The truth is,

source: KAK,
en: Ezra,

source: KEPADA
en: Leo Sunardi

source: ITU, APA MAU AKU
en: when you

source: DAN SETIAP BIDANG
en: Each division

source: S-SEBENTAR!
en: h-hold on!

source: Masih terus
en: whining

source: Semua terjadi dengan begitu cepat.
en: it all happened so fast.

source: TIDAK MAU
en: don’t want

source: TERTINGGI, KETUA DAN
en: The president and

source: WK WK WK
en: Ha ha ha

source: SEPERTINYA MEREKA ADALAH PENGUSAHA YANG MEMILIKI BANYAK BISNIS RAHASIA...
en: I think they own a lot of secret businesses...

source: PUNYA BANYAK
en: have much time,

source: PERLU TAKUT.
en: to worry.

source: SEMUA HAL YANG
en: everything

source: APA YANG AKAN KAK LEO
en: his next

source: ITU 'KAN
en: the snarky senior

source: KAU GILA,
en: Have you

source: Tidak bisa
en: Can’t

source: HEI…
en: Hey...

source: DAN AKU JUGA
en: Yes! Now I can

source: PELAKU SEBENARNYA.
en: isn’t the real culprit behind all of this.

source: TADI ANAK ITU
en: Ezra

source: ...RUMAH UTAMA KELUARGA SANJAYA.
en: ...the primary residence of the sanjayas.

source: DENGAN BEGITU
en: very naturally,

source: S-SEBENTAR,
en: H-hold on,

source: ITULAH ALASAN KAMI MENYUSUN RENCANA INI.
en: that’s why we came up with this plan.

source: SELESAI BICARA
en: talking to

source: TUNGGU…
en: W-wait...

source: MAAF KALAU
en: Sorry if

source: ANAK-ANAK KECIL BAU KENCUR...
en: hey, kiddos...

source: KENAPA AKU BEGITU BODOH!??
en: why am I so stupid?!

source: MENUNGGU DI
en: wait for you

source: sangat dingin?
en: was a cold guy.

source: DISKUSI DENGANNYA,
en: with him,

source: KEBIASAAN,
en: is...

source: ADA GOSIP
en: I heard

source: SEJAK AWAL
en: The situation’s

source: Mereka hanya
en: Their only

source: EKSPRESI YANG SAMA
en: the same expression

source: KALAU AKU TIDAK MARAH!??
en: that I wasn’t mad at you?

source: ATAU MUNGKIN
en: Was it because

source: Chiara sedang menuju
en: Chiara is on her way

source: BANTU…
en: help you...

source: PERATURAN SEKOLAH
en: for your

source: Eeehh?
en: huh???

source: SINI?
en: doing here?

source: APA YANG
en: Why should

source: KEPUTUSAN.
en: decisions.

source: IBU…
en: you...

source: entah kenapa
en: my mind kept thinking about

source: TAPI PAK NEV MEMANG AGAK ANEH, BUKAN?
en: but mr. nevada is indeed a bit odd, right?

source: TIDAK SALING KENAL
en: that close,

source: HEH!
en: Tsk

source: sekarang kau sudah
en: that you’re trying

source: KAPAN KAU AKAN
en: when are

source: PAK NEV DAN SEGERA
en: to what Mr. Nevada said and

source: SUDAH TAHU BELUM SIH
en: that I’m

source: JUGA…
en: also...

source: KAKAK…
en: but...

source: PERNAH MEMIKIRKAN
en: You never care about

source: H-HEI, MEMANG
en: O-oi, what

source: MENGAKU!
en: I confess!

source: APAKAH KAMU TAHU BAGAIMANA PAK ARDHAN BISA BANGKIT DARI KETERPURUKANNYA ITU?
en: do you know how mr. ardhan can recover from his failure?

source: APA YANG MEMBUAT KAKAK BERPIKIR,
en: what makes you think

source: YANG BAPAK DAN CHIARA
en: about

source: INI?
en: on here?

source: BEGITU, BUKAN??
en: happened, you know?!

source: SRAT!
en: Swoosh

source: KEPUTUSAN BERDASARKAN
en: your judgment,

source: HAL INI.
en: this.

source: aku tau ini?
en: need to know this...

source: Ruang CCTV
en: cctv room

source: AKU PASTI
en: I would

source: Coba pikirkan posisinya.
en: think about her position.

source: HEBOH, TAPI ORANG-ORANG
en: but, people said that

source: MAAF YA,
en: Sorry for

source: sayang
en: that’s too

source: Sejak awal, targetku hanyalah belajar untuk mengejar masa depan yang lebih baik.
en: since the beginning, I just want to study to pursue a better future.

source: DAN SETELAH AKU MENCARI TAHU,
en: after digging deeper...

source: Tentu saja.
en: yeah.

source: Pak Nevada.
en: Mr. Nevada.

source: Um…Belum ada…
en: n-not yet.

source: IYA SIH.
en: yeah, why?

source: PENGALAMANKU,
en: I know,

source: TAPI KENAPA
en: So, why has she

source: I-ITU...
en: a-about that...

source: Beritahu aku kalau sudah tersambung.
en: tell me when she picks up.

source: SAYA TAHU KAMU SEJAK AWAL TIDAK PERNAH BERNIAT MELEPAS CHIARA DARI OSIS,
en: I know you never planned to let her leave osis,

source: KAKAK TIDAK
en: A-are you

source: SAYA INGATKAN, RUANGAN INI PUNYA CCTV.
en: let me remind you that we have CCTV in this area.

source: SUM~
en: smi~

source: KAMU ADALAH
en: you’re an OSIS

source: FESTIVAL?
en: with the festival?

source: BAPAK SEDANG SIBUK
en: I know you’re busy

source: begitu??
en: like that?

source: KAU SUDAH
en: Are you

source: TERBURUK, APA
en: is that what

source: BENAR PENTING.
en: an emergency.

source: Sudah,
en: Enough

source: MEREKA HANYA
en: They only know

source: BEGITU!
en: understand now!

source: TERPOTONG TERUS.
en: keep getting cut off.

source: OSIS ATAU APA!
en: OSIS!

source: PADAMU?
en: to you?

source: BERTEBARAN DI MANA-
en: were literally all over

source: BERDUA KETAKUTAN,
en: Maybe they’re avoiding her because

source: KENAPA AKU DISERET
en: Why did you drag

source: Jika dugaan saya benar,
en: if my guess is correct...

source: PERASAANNYA TIDAK
en: his feelings were

source: MASA' IYA?!
en: You’ve got to be joking!!!

source: AKU TIDAK MAU
en: Why should I

source: DIA TERDENGAR
en: he seemed to be quite

source: TAPI...
en: but...

source: TIDAK PERLU MALU
en: there’s nothing to be embarrassed about,

source: PRIMADONA
en: the prima donna of

source: DIA ADALAH KETUA
en: him being the president

source: GUMAM
en: Mumble

source: TAPI SAYA JUGA TIDAK
en: However, I couldn’t

source: KEBELET.
en: pee.

source: MENYADARI COSPLAY
en: realize that

source: LAGIAN NGAPAIN SIH, KAU MELAKUKAN ITU??
en: why did you do that, though?

source: ..Chiara, aku-
en: chiara, I-

source: HEI,
en: Hey,

source: DAN DARI
en: Based on

source: KAK EZRA.
en: ezra.

source: TIDAK,
en: It’s okay,

source: KURANG LEBIHNYA
en: from the

source: INI ADALAH RUANG
en: the OSIS

source: mencari Burung
en: find

source: kau suruh aku untuk
en: me to bring

source: Lagipula
en: Besides, club members

source: KAK EZRA ATAU PUN
en: Ezra, and

source: SEMUA.
en: my business.

source: DIA SOK AKRAB
en: that’s why

source: SANGAT PENTING.
en: things, no?

source: MELIHAT DIA
en: saw him

source: anggota teater, tapi
en: the theater club member, but

source: DIA BUKAN TIPE
en: she’s not the type

source: APA GUNANYA DIA
en: then why’s he

source: KHAWATIR MEMBIARKAN
en: worried

source: UNTUK BICARA
en: to talk about this

source: SUARAKU!??
en: my voice?!

source: Saat ini, kami sengaja menentukan satu lokasi yang diminta oleh orang tadi.
en: Right now, we've specified one location that the person asked for.

source: HEI, HEI,
en: Hey, Hey,

source: YANG DIA INGINKAN.
en: his goal.

source: Kamu tidak mengerti, kejadian ini mungkin bukan hal yang biasa kamu hadapi.
en: you don’t get it. this isn’t something you usually deal with.

source: DAN SETELAH
en: After I’d discussed this issue

source: KARENA TIBA-TIBA
en: Suddenly,

source: Sampai kapan aku harus menemanimu?
en: how much longer do I need to be here with you?

source: LALU TADI JUGA NAOMI BILANG KALIAN INGIN MEMBICARAKAN SESUATU,
en: naomi also mentioned that you wanted to discuss something.

source: Masuk kalau mau selamat.
en: get in the care if you want to live.

source: PERLU DIKETAHUI,
en: to uncover.

source: IYA, IYA?
en: yeah, sorry?

source: KE DALAM BEBERAPA
en: several

source: Hei,
en: hey!

source: OSIS SEDANG
en: busy with

source: tersambung ke Ketua OSIS.)
en: will be monitored by the president.)

source: KETUA PANIK SEKALI
en: surprised,

source: …SEPERTI YANG
en: ...as I told

source: baru saja
en: I just get kicked

source: TERLEBIH LAGI
en: Not to mention

source: L-LAGIPULA...
en: b-beside...

source: J-JADI TIDAK ADA YANG PERLU DIKHAWATIRKAN!
en: s-so there’s nothing to worry about!

source: DEG!
en: thump

source: USAHA?
en: room!

source: ADA APA-APA AKU
en: happens, I can

source: spontan.
en: improvisation.

source: TAPI SEPERTI
en: But, I really

source: Mohon tunggu sebentar~
en: please wait for a sec...

source: EZRA PRANADIPA,
en: with Ezra.

source: SOALNYA KESAN
en: I think

source: Kembali ke masa kini.
en: back to the present

source: MANUSIA, SEMUA
en: and we, humans,

source: HAAH…
en: Huff...

source: DEMI MENGATAKAN INI,
en: Just so I can tell you this.

source: CHIARA UNTUK MEMBERI-
en: about

source: Bahkan sampai
en: I can’t believe

source: KAU JUGA MENUNGGU
en: You also waited

source: (Periode lalu
en: (She was secretary II

source: AKU MELIHATMU
en: I saw

source: RISIKO YANG MUNGKIN
en: the consequences

source: CHAT SAYA UNTUK
en: they asked me to come to

source: TIDAK MENGINGINKAN ITU.
en: didn’t mean to keep it from you.

source: SEBAGAI KETUA,
en: As a leader,

source: SEHARUSNYA TAU…
en: know...

source: Sungguh?
en: really?

source: BISIK
en: whisper

source: LEO MENGAKU
en: to be the president

source: ...AKU INI 'KAN BUKAN SIAPA-SIAPANYA CHIARA.
en: I’m not her boyfriend.

source: TIDAK?
en: cafeteria?

source: itu!
en: you know?!

source: PUNYA KAKAK YANG
en: called

source: JADI MEREKA MENJAUHI
en: they’re

source: BERAKHIR BAIK.
en: end well...

source: RASA PERCAYA
en: Trust is one of the

source: MENGENAL.
en: identities.

source: HARI INI.
en: today.

source: JADI BISA DIBILANG DIA
en: Therefore, she’s

source: TUMBEN-TUMBENNYA
en: What a surprise!

source: SEMUA ITU TELAH
en: It was all planned

source: SOAL INI,
en: chiara...

source: BIASANYA AKU
en: Usually, I don’t

source: sutradara.
en: Mr. Director.

source: Kami akan menghubungi bos kami dulu.
en: we’re talking to our boss.

source: DI WAKTU YANG
en: (redacted)

source: MEMUTUSKAN KALAU
en: that I don’t want

source: KEJADIAN KEMARIN.
en: what happened yesterday.

source: DIINGINKAN.
en: happens.

source: SAJA UNTUK DEKOR
en: to help

source: …ENTAH SALAH
en: ...I don’t know

source: PUN SAMA.
en: around you.

source: DITAMBAH LAGI KARAKTERNYAT TIDAK SEPERTI GURU PADA UMUMNYA...
en: plus, he’s unlike any other teacher.

source: U-UM…
en: U-umm...

source: ...BARUSAN NAOMI SUDAH MEMBERITAHU SECARA SINGKAT PADA KAMI.
en: naomi briefly told us about it.

source: KEADAANMU.
en: about this directly.

source: KEESOKAN HARINYA, JAM ISTIRAHAT PERTAMA.
en: the following day, during the first break

source: TAPI AKU...
en: but I...

source: ...SAYA BENAR-BENAR TIDAK BISA MENUTUPI APAPUN DARI BAPAK.
en: I can’t hide anything from you, can I?

source: BARU.
en: up.

source: SETELAHNYA, KETUA
en: Leo is interested

source: T-TENAGANYA KUAT JUGA!!
en: h-her power is quite amazing!

source: DIAM SAJA.
en: anything.

source: BU-
en: Miss--

source: A-Aku baru saja menerima pesan lagi dari orang itu, dan isinya…
en: I just got another text. it says...

source: HASILNYA MALAH
en: the situation

source: BERSAMAAN.
en: (redacted)

source: SEKOLAH, KAMI HARUS
en: officials, we’ve got

source: BICARA ISINYA SELALU
en: comes out of your mouth

source: APA, TERNYATA KAMU
en: but

source: KAU LEBIH
en: coming from

source: KENAPA HARUS
en: go to the

source: lagi?
en: vice president.

source: melibatkan Naomi
en: you also dragged

source: Jangan ganggu Chiara.
en: but don’t get in her way.

source: DAN MENGHADAPI
en: Going through

source: BERTEMU LAGI
en: meet again

source: INI SEBAGAI MARKAS
en: as your hiding spot,

source: LAGIPULA, SEPERTINYA BANYAK YANG PERLU KAU KATAKAN PADA WAKATOS, BUKAN?
en: besides, there’s a lot of things you wanna say to the vice president, right?

source: BISA KITA BAHAS
en: discuss

source: YANG SEBENARNYA,
en: the truth,

source: DIA PASTI SANGAT TERPUKUL...
en: it must’ve broken him to the core...

source: KAKAK NGAPAIN?
en: what are you doing?

source: MAAF SAYA TIBA-TIBA
en: Sorry for the

source: Tiba-tiba ada dua pria tidak dikenal memanggil namaku,
en: suddenly two men called my name, and...

source: AKU JADI TERLIBAT
en: How did I get

source: BELUM LAGI
en: Not to mention

source: …Hei,
en: hi...

source: TIDAK APA,
en: Oh, it’s okay,

source: EKSPRESINYA
en: His expression

source: KOMUNIKASI.
en: communicate.

source: BERCANDA, KOK.
en: just kidding.

source: SUDAH PASTI
en: Every decision that we’ve made

source: DENGAN PENGURUS
en: The other members of OSIS

source: DIA AKAN KABARI
en: he would update

source: KALAU ADA,
en: If he was,

source: AKU DENGANMU!
en: to a playboy like you!

source: D-DIA
en: Did he say

source: MENCARI TAHU APA
en: in order

source: MORAL SEKOLAH
en: about

source: PERCAYAILAH
en: trust

source: KAMU DUA KALI DIPILIH
en: considering how sharp that

source: TAPI INI SATU-SATUNYA
en: but this is our only

source: WAKATOS BERTEMU DAN
en: the Vice president met

source: DEKAT DENGAN SIAPAPUN
en: with someone,

source: KADANG KITA HARUS MULAI DARI KAWAN SENDIRI.
en: ...you must first deceive your allies.

source: Aku bisa memanfaatkan ini!
en: I can use it.

source: Sekarang bukan waktunya untuk melankolis.
en: now is not the time to be sad.

source: APA YANG KALIAN LAKUKAN BENAR-BENAR MEMBUAT SAYA BINGUNG.
en: all of your actions have left me baffled.

source: JADI…
en: So...

source: YANG UNIK.
en: OSIS system.

source: MENGATAKAN
en: told her

source: Suasananya
en: It was really

source: Bisa dibilang
en: I guess

source: Kalau saya tidak geer, ya...
en: or is it just me...?

source: KAMUFLASE.
en: show.

source: AKU MENGERTI
en: I understand

source: INGIN MENDENGARNYA
en: best for me to hear it

source: YANG MEMBUAT
en: you,

source: MENDEKATI CHIARA,
en: her.

source: MASIH BANYAK
en: so many things

source: ART AND CULTURAL BUILDING, AUDITORIUM
en: (redacted)

source: EZRA DEKAT DENGANMU…
en: Even though you and Ezra seem to be quite close...

source: AKU INI BERBAIK
en: I’m just

source: TERNYATA INI JUGA
en: this is also

source: SEBENARNYA DIA
en: Does she already know

source: UNTUK OSIS,
en: OSIS too,

source: SEMUA ITU
en: I’m

source: TAPI UNTUNGNYA, HASIL AKHIRNYA SAMA SEPERTI YANG SAYA HARAPKAN.
en: luckily, the outcome was as expected.

source: BERHUBUNGAN
en: about

source: ZONA B
en: Zone B

source: K-KAK EZRA??
en: ezra?!

source: CANDAAN KEKANAKAN
en: her childish

source: KAKAK MARAH??
en: Ezra?

source: BAIKLAH AKU AKAN MELAKUKANNYA.
en: okay, I’ll do it.

source: JADI ULAH APA LAGI YANG KAU LAKUKAN, SAMPAI MEMANGGILKU KE SINI LAGI?
en: what have you done this time that I have to come all the way here?

source: TERJADI, YA?
en: between them, I wonder?

source: AKU TIDAK BISA
en: I can’t let

source: APA INI
en: Is this supposed to be

source: BELAKANGAN INI,
en: started talking.

source: MENERIMANYA
en: take this in

source: MEREKA TIDAK PERLU
en: They don’t need

source: KAMU MENYURUHKU
en: ask me

source: MEMBIARKANMU
en: you go through this

source: APA KAMU
en: Do you

source: MENDADAK ADA
en: I don’t think so.

source: SAAT INI.
en: be for now.

source: DAN DULU AKU BERUSAHA MENGHIBURNYA...
en: so I did my best to cheer her up.

source: B-BAIK..?
en: o-okay.

source: ABAL-ABAL BEGINI?
en: I was doing a cosplay!

source: HUBUNGANNYA,
en: the relationship you both have,

source: YAH… KATANYA SIH
en: Well... I heard they

source: Tapi kita tidak tahu apa yang mungkin mereka lakukan padamu.
en: but we don’t know what they might do to you.

source: SEMUA YANG AKU BISA
en: do it

source: DIA BERSAMA
en: What’s he doing

source: Ada apa sih memangnya?
en: what’s going on?

source: KALAU SUDAH
en: We can talk about

source: SAMPAI KETEMU NANTI DI RUANG KEPSEK.
en: see you at the principal’s office.

source: TAPI RASANYA
en: but it was

source: YANG MUDAH
en: to trust

source: YANG PERLU
en: else

source: BERHENTI
en: stop

source: Saya mengerti juga kecurigaan kalian.
en: I understand your concern.

source: TADI SAYA BICARA
en: I just had a talk

source: SRAK
en: rustle

source: WAKTUNYA,
en: time

source: RUANGAN INI
en: of the

source: ANGGOTA OSIS AKTIF.
en: of OSIS.

source: SINI SEBELUM SAYA
en: or you’ll feel

source: SAYA BERUSAHA
en: I also tried

source: MENGIDOLAKAN
en: up to you,

source: PADA KALIAN-
en: you--

source: SEBAGAI PETINGGI
en: As the school

source: SELESAI, YA??
en: they’re done?

source: HAL YANG PALING TEPAT UNTUK DILAKUKAN SEKARANG ADALAH BERTANYA PADA KEPSEK, BUKAN?
en: the best thing to do now is to question the principal, right?

source: PERNYATAANKU TENTANG
en: for all the things I’ve been meaning to ask

source: SUDAH DENGAR
en: heard some of the details

source: MEMILIKI KECURIGAAN
en: a suspicion

source: OLEH KETUA LEO.
en: was greeted by Leo.

source: enak..?
en: this?

source: MENILAI SKENARIO
en: you can rate

source: DI SITUASI
en: even in

source: DIA ADALAH SISWA
en: he’s still

source: KALIAN BERDUA SAJA YANG PERGI YA.
en: you two should go without me.

source: BU.
en: mrs. nina.

source: KALAU BEGITU AKU AKAN MENUNGGU KABAR SELANJUTNYA DARIMU.
en: I’ll wait for your update on this one.

source: MENDISKUSIKANNYA
en: discuss this with

source: DENGAN DEMIKIAN...
en: that being said...

source: OSI
en: OSIS

source: DI DEPAN GERBANG
en: sulking

source: UNTUK ORANG
en: I can’t believe

source: Eh?
en: huh?

source: MENUTUPI SIAPA PARTNER
en: to hide their partner’s

source: LENGAH.
en: You’re still a member of OSIS, you know?

source: Hebaat, Cantika!!
en: good job, cantika!!!

source: KRISOPAS DIBAGI
en: OSIS is divided into

source: KOK KALIAN BISA DI SINI!??
en: what brings you here???

source: TAPI SAYA JUGA BERPIKIR...
en: but on the other hand...

source: ...KARENA ITU, SAYA BERSEDIA MENDENGAR SEMUANYA.
en: therefore, I’m ready to know the truth.

source: PERCAYA.
en: wary of.

source: DARI SEKEDAR
en: are much more than

source: APAKAH BERITA
en: Is it

source: OSIS YANG ADA
en: the president

source: APA MAKSUD...
en: what are you implying-?

source: Ayo kita pindah ke tempat yang lebih sepi.
en: let’s go somewhere more quiet!

source: KEPADA SAYA NANTI.
en: later.
